{
  "version": "0.0.2+b7c0458e63faab58bab172e6f7831d94465d87c3",
  "timestamp": "2025-07-03T13:34:51Z",
  "model": null,
  "seed": null,
  "id": "5aba3441-4ab3-4fb5-82d0-2fb256166e93",
  "parentId": null,
  "complete": null,
  "personas": null,
  "scenario": null,
  "turns": [
    {
      "speaker": "DOCTOR",
      "text": "Hello?"
    },
    {
      "speaker": "PATIENT",
      "text": "Hello?"
    },
    {
      "speaker": "DOCTOR",
      "text": "Hello? Can you hear me OK?"
    },
    {
      "speaker": "PATIENT",
      "text": "Hello."
    },
    {
      "speaker": "PATIENT",
      "text": "Uh I can hear you, but I can't really see you."
    },
    {
      "speaker": "DOCTOR",
      "text": "That's perfect. Um"
    },
    {
      "speaker": "PATIENT",
      "text": "Is, is that OK? Am I meant to"
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/> this audio. And then it's absolutely fine."
    },
    {
      "speaker": "PATIENT",
      "text": "Just <INAUDIBLE_SPEECH/> connection on the screen."
    },
    {
      "speaker": "DOCTOR",
      "text": "Uh, now before I go any further, can I confirm your name and your age?"
    },
    {
      "speaker": "PATIENT",
      "text": "OK."
    },
    {
      "speaker": "PATIENT",
      "text": "Um so, um my name is uh Dan Choudhry. I am seven, twenty seven."
    },
    {
      "speaker": "DOCTOR",
      "text": "Twenty seven, OK. And how can I help you this afternoon, Dan?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um so I've just um, been having some troubles, basically in the <INAUDIBLE_SPEECH/> uh, I guess it's been a little while now. And I've just been feeling not so great. And"
    },
    {
      "speaker": "PATIENT",
      "text": "It's all come from like, uh it's like basically I think it's diarrhoea. And it's like just coming out, like loads of it. Like I go to the toilet and it's just super watery and it"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah it doesn't feel very solid. It so, it just, it's just pouring straight from my bum, and like just coming out. And it's, uh,"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah it's just uh not, not been very pleasant. And like I just, it just kind of hasn't, doesn't feel like it's getting better. So"
    },
    {
      "speaker": "DOCTOR",
      "text": "Wow, no. Sorry to hear. Seems like there's a lot going on there. Well, when did it all start, your symptoms?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, so I think it was a few, when I think about it"
    },
    {
      "speaker": "PATIENT",
      "text": "So Monday, Tuesday, I I, so I think it was about three, it's been about three days now."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. And <UNSURE>is it</UNSURE> mainly diarrhoea? So, you mentioned watery stools. Um"
    },
    {
      "speaker": "DOCTOR",
      "text": "How many times are you going a day, would you say?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um so I <UNIN/>, I feel like it's like almost every hour, when I'm awake."
    },
    {
      "speaker": "PATIENT",
      "text": "Um, <UNSURE>so </UNSURE> <UNIN/>. Sorry?"
    },
    {
      "speaker": "DOCTOR",
      "text": "Alright, wow. OK. So you're losing a lot of, a lot of, you're using a lot of fluid there."
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah, so I mean I'm <UNIN/>, I'm trying to drink a lot of water."
    },
    {
      "speaker": "PATIENT",
      "text": "But um, yeah it's just quite a lot and"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh it's, yeah I I, I think I <UNIN/> I feel like it's just, just fluids coming out."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Have you got any blood in your stools?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um"
    },
    {
      "speaker": "PATIENT",
      "text": "So I, no I don't, I don't remember anything, like, no I <UNIN/>, I think it's just I, nothing like that. There's nothing like that."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNSURE>OK</UNSURE>. And any, any tummy pain? Any, any, any pain in your tummy? <INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah. I mean I, it, I feel, I feel a <UNSURE>cramp</UNSURE>."
    },
    {
      "speaker": "PATIENT",
      "text": "<UNIN/> and then, and then I know it's time to go right? So, <UNIN/>around every hour I just feel something come up. And then I have to go. So, yeah I mean that's, that's the <UNIN/>, kind of the first sign."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "Where is this crampy pain? Which part of your tummy?"
    },
    {
      "speaker": "PATIENT",
      "text": "It's kind of, <INAUDIBLE_SPEECH/>. If I think about it, it's like, it's like at the bottom. Uh, I don't know if that makes sense. Um"
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNIN/>. Well why don't we start with, is it, is it in the middle, or is it to one particular side?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um I I think it it <UNIN/>, it feels pretty <UNIN/>, like in the middle, to me. Not on any side, left or right."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. And does the pain come and go, or is it there constantly?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, it it comes and goes. It comes and goes."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNIN/>. Fine, OK. And if I was to ask you on a scale of one to ten, ten being the worst pain you ever had, how bad is this pain?"
    },
    {
      "speaker": "PATIENT",
      "text": "OK so like"
    },
    {
      "speaker": "PATIENT",
      "text": "Um"
    },
    {
      "speaker": "PATIENT",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "PATIENT",
      "text": "So"
    },
    {
      "speaker": "PATIENT",
      "text": "What do you mean by, uh pain? So I, I think it's maybe a"
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/> Is it, is this pain as in making you double over? Is it ten, is it ten out of ten, the worst pain you ever had? Or is it more of a kind of a mild pain, like a three out of ten?"
    },
    {
      "speaker": "PATIENT",
      "text": "I I guess so. I'm, when I think about it, like when I get it, I can pretend that I don't feel it. So I can still sit down and"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh I can still like cover it up, and people don't really notice. So I, I don't know what that means. But maybe is that like a six, or a seven? <UNIN/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/> solid six. OK, OK. Alright, good. Um, and apart from the pain and diarrhea, any other symptoms like nausea, vomiting?"
    },
    {
      "speaker": "PATIENT",
      "text": "<UNSURE>OK</UNSURE>."
    },
    {
      "speaker": "PATIENT",
      "text": "Um, yeah I definitely, I definitely feel kind of nauseous. Um"
    },
    {
      "speaker": "PATIENT",
      "text": "Like I and, like I've have vomited. And when I like, I think it's maybe something to do with like, whenever I have like milk or something like that, I just feel like I want to vomit. And actually, <UNIN/> yeah one time I just like had some milk, and I just completely vomited it."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNSURE>Not sleeping</UNSURE>. OK, alright. Uh"
    },
    {
      "speaker": "PATIENT",
      "text": "<UNSURE>Um, I've been</UNSURE>, I've been trying to avoid it. But um, yeah."
    },
    {
      "speaker": "DOCTOR",
      "text": "And the vomiting is not as pronounced as the diarrhea. Is that right?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, sorry could you repeat that?"
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/> and the vomiting is not as, uh, prominent as the diarrhea. Is that right?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh no, no it's not."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. OK, alright. Um, any other symptoms, like fevers or temperatures?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um so I, yeah I think I am pretty, I feel kind of really hot all the time. And uh I'm pretty sure I'm burning up. I haven't actually done any temperature reading, or anything like that. But it's, I, yeah I've, I've sure I'm, I'm not a, like not a normal temperature."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, so you're feeling hoarse. OK. And in terms of your waterworks, are you passing urine OK?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um yeah a bit, I guess less frequently maybe. Um but yeah, it seems to be OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, alright. Um, fine. And, and you said that, you mentioned, three days ago was when it all kicked off. Are you aware of any triggers? I mean, have you for example gone out, had some takeaway food? Have you been around anyone else, um with diarrhea, for example?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um so I <UNIN/>, so my um my brother has had, actually had something like this for um <UNIN/> he has it as well for five days, as well. Um and I I've, I'm not, yeah I <UNIN/> I can't think of what, what the trigger is for me. I mean, my brother normally can deal, deals with this stuff a lot better than me. But <UNIN/>, yeah I, that's why"
    },
    {
      "speaker": "DOCTOR",
      "text": "Is your, is your brother now better?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um"
    },
    {
      "speaker": "PATIENT",
      "text": "He, so he's been like this for five days. I think he's getting better, but I'm not, I'm not really sure. He said, he said he had, he's had something for a little while as well."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, alright. Are you having anything to eat or drink? Have you, I can see you're drinking a coffee, but are you keeping it down? Are you keeping your fluids down?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um so it just feels like the, the fluids do go down. But it just feels like it's going straight through."
    },
    {
      "speaker": "PATIENT",
      "text": "It just feels like it's going straight through."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, alright. Fine. When was the last time you had anything solid to eat? And which <UNIN/>, which uh which you kept in?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um so, I had some, I mean I had some lunch today. Um"
    },
    {
      "speaker": "PATIENT",
      "text": "But again it just it <UNIN/> just came, come out pretty loose."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, alright. Um and and Dan, moving forwards, are you otherwise fit and well, or do you have any other medical history?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, so I um, yeah I think, I think otherwise I'm fit and well. I um"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah I mean I, I'm an OK weight. And um, I I can't think of any related medical history."
    },
    {
      "speaker": "PATIENT",
      "text": "Um, I mean like my, yeah I <UNIN/> no I <UNIN/> I don't think so."
    },
    {
      "speaker": "DOCTOR",
      "text": "Good."
    },
    {
      "speaker": "DOCTOR",
      "text": "I'll take it you don't take any regular medications, then."
    },
    {
      "speaker": "PATIENT",
      "text": "So I"
    },
    {
      "speaker": "PATIENT",
      "text": "Um"
    },
    {
      "speaker": "PATIENT",
      "text": "No I mean I, I've been taking some like Paracetamols and stuff like that lately. But uh, I haven't been, I'm not on any regular medication or anything like that."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. And do you have any allergies to any medications?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, so I don't have any allergies that I know of."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. And what about any family history? Do you have any family history of bowel problems? <INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "PATIENT",
      "text": "Um bowel, so would, would bowel like, is is the colon like something that"
    },
    {
      "speaker": "DOCTOR",
      "text": "Yeah, yeah. So what I mean by bowel is the whole gut. So it could be anything from the <UNIN/> mouth anus."
    },
    {
      "speaker": "PATIENT",
      "text": "<INAUDIBLE_SPEECH/> So my, yeah my, my dad actually has um colon cancer at the moment."
    },
    {
      "speaker": "DOCTOR",
      "text": "Ohh dear. I'm very sorry to hear that. How is he?"
    },
    {
      "speaker": "PATIENT",
      "text": "So um, from what I heard he's kind of, So I don't I don't speak to him that often. So I don't, I don't know the exact details. And I, I don't exactly know the full things of like the steps of cancer, and all that kind of thing. But um, he's sort of in his third stage. Uh, I'm not sure what that means exactly."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, and yeah. So yeah it's, it's um, he's, yeah you can, yeah I can see he's kind of weaker, and it's affecting him a lot. And um, that's <UNIN/> it's quite, I I guess he's um, had it for a little while now."
    },
    {
      "speaker": "DOCTOR",
      "text": "Yeah, OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/> Yeah I'll make a not of that 'cause uh, <UNIN/> important to know these kind of details. Um, and socially, tell me more about your home situation. Who's at home with you, Dan?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um so, uh not my brother. He doesn't live with me. I'm, I live with my, um sister and my mum."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. And, uh, how are things at home?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, I think, <UNSURE> I mean</UNSURE> in what sense do you mean that?"
    },
    {
      "speaker": "DOCTOR",
      "text": "Don't <INAUDIBLE_SPEECH/>."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNIN/> in general day-to-day life are you managing OK? Any particular <UNIN/>?"
    },
    {
      "speaker": "PATIENT",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "PATIENT",
      "text": "I mean uh"
    },
    {
      "speaker": "PATIENT",
      "text": "I think uh, yeah it's been, it's been tricky. Um"
    },
    {
      "speaker": "PATIENT",
      "text": "Going to work with all of this. Um I dislike um, taking time off work. I feel like I I just want to go, um when I can. So I <UNIN/> I try and go um"
    },
    {
      "speaker": "PATIENT",
      "text": "I think at, at home, uh yeah I just haven't really um"
    },
    {
      "speaker": "PATIENT",
      "text": "I I don't normally actually um, eat with my family. I normally am buying stuff and that kind of thing. So, I don't think it's affected them. And I haven't really been, haven't really gone into detail with my sister and my mom about it. Um"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah. I'd, I'd just rather deal with these things. Um so <INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "Sure. <INAUDIBLE_SPEECH/> you mentioned work. You mentioned work. What is it you do for work?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um"
    },
    {
      "speaker": "PATIENT",
      "text": "So I work at a, I I work at um an office, um in Central London. Um it's uh, so I work in government."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNIN/>, OK. So <UNIN/>, OK right. And just a couple last final couple, uh couple <UNIN/> questions. Uh, smoking and alcohol, do you do either? Do you smoke, or do you drink much in the way of alcohol?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um so I I smoke um, I smoke uh, uh for like socially, but not like regularly. Um"
    },
    {
      "speaker": "PATIENT",
      "text": "So normally if if it's a, a Friday or something like that I might, I might have a cigarette or something like that. But um not <INAUDIBLE_SPEECH/>."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "PATIENT",
      "text": "Sorry?"
    },
    {
      "speaker": "DOCTOR",
      "text": "And alcohol?"
    },
    {
      "speaker": "PATIENT",
      "text": "So alcohol, um <UNIN/> uh you know I might have a a beer during the weekdays, maybe uh not that many, maybe um <INAUDIBLE_SPEECH/>. On Fridays I have more um alcohol um"
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "But not <UNIN/>."
    },
    {
      "speaker": "PATIENT",
      "text": "But yeah uh, I'll have my units um"
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh, honest, I suppose um, not every week, but maybe I'll once or twice a month, that yeah, I'll go out with my friends and drink a lot so that that's um, yeah um"
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "Well thank you for <UNIN/> me. That's really helpful to know. So um, Dan, just as a a conclusion, uh um, just to wrap it all up, I think your symptoms are suggestive of something called gastroenteritis."
    },
    {
      "speaker": "PATIENT",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "bit of a basic infection of your tummy. <INAUDIBLE_SPEECH/>. There's nothing to worry about. Uh um uh uh I suspect this will just settle down in the next few days."
    },
    {
      "speaker": "PATIENT",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "Just like you did for you brother. Drink, make sure you drink plenty of fluids, OK? And you can <UNIN/>"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh-huh."
    },
    {
      "speaker": "PATIENT",
      "text": "Should I just drink like normal water? I just feel like every time I drink <UNIN/> it's just coming out. Um <INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNSURE>Right</UNSURE>."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNIN/> fluid is probably best. But I am obviously worried about the fact that you are losing minerals and vitamins. Um so, you can get things like Diarolyte, which is um, a fluid replacement you can get from the pharmacy. It's probably worth <UNIN/> uh recommending that."
    },
    {
      "speaker": "PATIENT",
      "text": "<INAUDIBLE_SPEECH/> Do i need like a prescription for that?"
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNIN/> no, you can just get that over the counter."
    },
    {
      "speaker": "PATIENT",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "Um, you can try just you know regular Paracetamol if you are feeling feverish. But if your symptoms aren't settling down in the next couple of days, so forty eight hours, I want you to give me a call back."
    },
    {
      "speaker": "PATIENT",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "Because um, you know if you are getting dehydrated then we need to do further investigations, OK? But I think let's, let's see how you are in the next one to two days."
    },
    {
      "speaker": "PATIENT",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "And uh, we'll catch up soon, OK?"
    },
    {
      "speaker": "PATIENT",
      "text": "OK. So you're saying that I should, <UNIN/> I could, uh I'll try and buy this Dioralyte. What, what should I do in terms of um, food and that kind of thing? Should I just focus on fluids?"
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/> clear fluids. You can use soft diet, things like soup, mash. And then gradually build up, um as much as your body can tolerate."
    },
    {
      "speaker": "DOCTOR",
      "text": "Um, but let's try and keep yourself well-hydrated first, OK?"
    },
    {
      "speaker": "PATIENT",
      "text": "OK. Is it OK for me to carry on having like, um Paracetamol and things like that?"
    },
    {
      "speaker": "DOCTOR",
      "text": "Absolutely. If you are having, if you've got a bit of tummy pain, if you're feeling feverish, then I think Paracetamol is very sensible."
    },
    {
      "speaker": "PATIENT",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK? Try and <UNIN/> avoid alcohol if you can."
    },
    {
      "speaker": "PATIENT",
      "text": "Uh, OK I'll try. Yeah."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Alright then."
    },
    {
      "speaker": "PATIENT",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "Thank you for your help."
    },
    {
      "speaker": "PATIENT",
      "text": "Alright. Thank you very much. Thanks, thanks for helping me out."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>. Thank you. Bye bye now."
    },
    {
      "speaker": "PATIENT",
      "text": "<UNSURE>K. Bye.</UNSURE>"
    }
  ],
  "events": null,
  "notes": null
}