{
  "version": "0.0.2+b7c0458e63faab58bab172e6f7831d94465d87c3",
  "timestamp": "2025-07-03T13:34:51Z",
  "model": null,
  "seed": null,
  "id": "b107f64b-2c37-42ae-92eb-4438673ee233",
  "parentId": null,
  "complete": null,
  "personas": null,
  "scenario": null,
  "turns": [
    {
      "speaker": "DOCTOR",
      "text": "There's no <INAUDIBLE_SPEECH/>. <UNIN/>, hello?"
    },
    {
      "speaker": "PATIENT",
      "text": "<UNIN/>. Hi there."
    },
    {
      "speaker": "DOCTOR",
      "text": "Hello there. Um, thanks for, thanks for, being here. Um, before I go any further, can I uh, confirm your name and your age please?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yes, it's um Adriana Katherine <UNIN/>. And I'm twenty six year old."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, Adriana, and how can I help you this afternoon?"
    },
    {
      "speaker": "PATIENT",
      "text": "Well, I have this like really crazy headache that's been going on for a few days. And it really annoys me."
    },
    {
      "speaker": "DOCTOR",
      "text": "Ohh dear, OK. <UNIN/>, when, when did it exactly start, this headache?"
    },
    {
      "speaker": "PATIENT",
      "text": "Eh, around three days ago, maybe."
    },
    {
      "speaker": "DOCTOR",
      "text": "Three <UNSURE>days</UNSURE> ago, OK. And whereabout in your head, is this pain?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, it's basically like, it kind of feels all over my head, but like mainly, um, around my right eye. Um"
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>, OK. Um, and is the, headache there all the time, or does it come and go?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um it's, it kind of comes and goes. Um but, I mean it is there all the time, but <UNIN/> like sometimes it's stronger."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, so it comes and, fine, OK. And if I was to ask you on a scale of one to ten, um, ten being the worst type of pain you ever had. How would you rate this headache?"
    },
    {
      "speaker": "PATIENT",
      "text": "Ohh it's probably a eight."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNSURE>Eight</UNSURE>. And if I was to ask you describe the headache to me, um, in terms of the nature of the pain. Is it sharp? Is it dull? Is it crampy? Is it throbbing?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, it's kind of, it's dull but sometimes it gets a bit sharper. So basically it like, it developed gradually, I guess. It's like the first day it just started when I was at work."
    },
    {
      "speaker": "DOCTOR",
      "text": "Mm-hmm."
    },
    {
      "speaker": "PATIENT",
      "text": "And by the end of the day it was like pretty, pretty, like it was a lot, basically. And then I was thinking OK, maybe I'll just go to sleep. And when I woke up the next morning like, it was even, even worse basically. So"
    },
    {
      "speaker": "DOCTOR",
      "text": "Mm-hmm."
    },
    {
      "speaker": "DOCTOR",
      "text": "So, you think the headache is getting worse over the last three days?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Have you tried anything which has made the headache better?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um so I tried uh Ibuprofen. Um so I took, like a few. Um for the last two days, basically."
    },
    {
      "speaker": "DOCTOR",
      "text": "Did that <UNSURE>help</UNSURE>?"
    },
    {
      "speaker": "PATIENT",
      "text": "But it doesn't really help, no. In in the past it did help me, which is why I decided to try it. But"
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, all right. And except for the headaches, any other symptoms at all?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um"
    },
    {
      "speaker": "DOCTOR",
      "text": "So, <UNSURE>example</UNSURE> any, problems your eyesight or your vision?"
    },
    {
      "speaker": "PATIENT",
      "text": "Not really, but just when it started, I I got this like weird shooting lights. And like now like light is quite annoying, my eyes."
    },
    {
      "speaker": "DOCTOR",
      "text": "So when you say annoying, does it hurt to look, uh, look at bright lights?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah, yeah. It hurts. So"
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNIN/>, OK. And um, have you had any loss of vision or blurry vision?"
    },
    {
      "speaker": "PATIENT",
      "text": "Not loss of vision, I wouldn't say. It's just like some lights from, shooting lights <INAUDIBLE_SPEECH/>."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNSURE>Mmm</UNSURE>, <UNIN/>, <UNSURE>OK</UNSURE>. Any nausea or any vomiting?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, well I'm like basically, I I'm sick with the headache. But I, no vomiting."
    },
    {
      "speaker": "DOCTOR",
      "text": "When you say sick, you mean you feel sick? OK. Yeah, no vomiting, OK. Any neck pain or neck stiffness?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah."
    },
    {
      "speaker": "PATIENT",
      "text": "No."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. And any difficulty with speaking or, um, speech?"
    },
    {
      "speaker": "PATIENT",
      "text": "No."
    },
    {
      "speaker": "DOCTOR",
      "text": "Any difficulty <UNIN/>, with weakness in your arms and legs?"
    },
    {
      "speaker": "PATIENT",
      "text": "No, it's hard to focus though. So, I I had to take a couple of days off work, actually."
    },
    {
      "speaker": "DOCTOR",
      "text": "Ohh really? OK. OK, <UNSURE>yeah probably</UNSURE>, well I'll, I'll ask you a bit more about your work later on. Um, any recent head injuries at all?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh, no."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. And have you had anything like this before in the past?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah I mean, headaches, you mean."
    },
    {
      "speaker": "DOCTOR",
      "text": "Or, uh, or similar, similar to, similar to this kind of headache, <INAUDIBLE_SPEECH/>?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah. I mean I had. But, usually after I I take uh Ibuprofen it kind of goes away. So, but this time it's just not. <INAUDIBLE_SPEECH/>."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/> not, OK. All right. Um, any temperatures, or fevers?"
    },
    {
      "speaker": "PATIENT",
      "text": "No."
    },
    {
      "speaker": "DOCTOR",
      "text": "Any rashes at all, on your skin?"
    },
    {
      "speaker": "PATIENT",
      "text": "Mm, no not that I've noticed."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. And just moving forwards. Are you otherwise fit and well, Adriana?"
    },
    {
      "speaker": "PATIENT",
      "text": "Am I what, sorry?"
    },
    {
      "speaker": "DOCTOR",
      "text": "You fit and well? <UNIN/>, do you have any other medical <UNSURE>history</UNSURE>?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah, I think so. It's just the headache."
    },
    {
      "speaker": "DOCTOR",
      "text": "Any history of migraines at all?"
    },
    {
      "speaker": "PATIENT",
      "text": "Not myself, I've never had a migraine. But my sister and my mom have them quite frequently."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Um, fine. I'll ask you a bit more about that in just a second. Before I go any further, can I ask, do you take any regular medication?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh, no no."
    },
    {
      "speaker": "DOCTOR",
      "text": "Are you on the pill?"
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Do you have any allergies to any medications?"
    },
    {
      "speaker": "PATIENT",
      "text": "Mm not that I know of."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. So you mentioned your mother and sister both have migraines."
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah."
    },
    {
      "speaker": "DOCTOR",
      "text": "Are they, is that normally well-controlled or are they um, having difficulty, controlling their symptoms?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um so my sister's, like better. Like it's kind of, it's very rare. But my mom's is like quite bad, um usually when there's like a season changing and stuff like that. It's, yeah."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNSURE>Mm-hmm, OK</UNSURE>."
    },
    {
      "speaker": "PATIENT",
      "text": "Takes her out for a few days, basically."
    },
    {
      "speaker": "DOCTOR",
      "text": "Ohh right, OK, fine. Um, socially, tell me a bit more about your life, outside of, um, outside of, work. So <UNIN/>, who lives at home with you?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh I live with housemates. So, three of them. So we're four <UNIN/>."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNSURE>OK</UNSURE>. Excellent. And are you working at the moment? You mentioned this <UNIN/>, impacting on your work."
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah so I work, well I work in IT. So I work with computers a lot. So it kind of is difficult to focus. Um I had to like reduce the uh, brightness of my screen."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNSURE>Mmm</UNSURE>. OK. Do you wear glasses?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yes, I do."
    },
    {
      "speaker": "DOCTOR",
      "text": "Have you had any, uh, have you had any recent eye check, done? Eye test?"
    },
    {
      "speaker": "PATIENT",
      "text": "No, uh I've been wearing them since I was five <UNIN/>, five year old. <UNSURE> So, it's quite a long time.</UNSURE>"
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, all right. Something for you to bear in mind if you feel that you are, your eyes are straining. Um I would always recommend having a repeat eye test done. Um, have you been feeling more stressed or anxious at work recently?"
    },
    {
      "speaker": "PATIENT",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "PATIENT",
      "text": "Well, it's been a bit stressful, kicking off a new project. But um, yeah nothing out of the ordinary, really."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, all right. Great. Um, regarding smoking or alcohol. Do you drink or smoke at all?"
    },
    {
      "speaker": "PATIENT",
      "text": "I socially smoke. And I drink <UNIN/> only socially."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNSURE>But</UNSURE> only socially?"
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "Right. Now um, Adriana, do you have any ideas as to what could be causing your symptoms? Have you, have you read anything online, or spoken to people?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um"
    },
    {
      "speaker": "PATIENT",
      "text": "Not really. Um <INAUDIBLE_SPEECH/> at first I thought it's stress, or maybe I didn't drink enough water. Because sometimes when I don't drink enough water, I I like get headaches. Um"
    },
    {
      "speaker": "DOCTOR",
      "text": "Mm-hmm."
    },
    {
      "speaker": "PATIENT",
      "text": "But, I don't think that's it. And I'm like worried, it's, I don't want it to be a migraine. Because I know what it's like, from my mom and my sister."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "Mmm."
    },
    {
      "speaker": "PATIENT",
      "text": "And it's really annoying. So I I really don't want to have that. And I know it's genetic. So I've researched that. Um but I don't know if that is the case. So, yeah."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Is <UNSURE>it</UNSURE> anything in particular you were hoping I could do for you today?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah maybe just kinda, if you have any recommendations of <UNIN/> that I can take something stronger. Because apparently, Ibuprofen doesn't help me. Uh"
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNSURE>OK</UNSURE>."
    },
    {
      "speaker": "PATIENT",
      "text": "Usually it gets resolved if I have headache in like, after like one or two days. But currently it, it didn't help me."
    },
    {
      "speaker": "DOCTOR",
      "text": "How many tablets did you take of Ibuprofen?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh, three a day."
    },
    {
      "speaker": "DOCTOR",
      "text": "Three a day, OK. All right. Um, so uh, Adriana, so um, really what I think is going on here. I <UNIN/>, uh, unfortunately I do think this could be, a headache very similar to a migraine."
    },
    {
      "speaker": "PATIENT",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "Um, the reason I say that is because the history is very suggestive of it, given your mum and your sister also migraines. I think it's something for us to think about."
    },
    {
      "speaker": "DOCTOR",
      "text": "Um, now I'm not saying it's gonna, keep happening, but, it may just be a one-off. But it's certainly worth treating it today stronger <UNSURE>analgesia or</UNSURE> painkillers."
    },
    {
      "speaker": "DOCTOR",
      "text": "Um, now moving forward, we have some options which we can discuss. Uh, you tried the Ibuprofen. Now, my only worry is, I'm not sure whether you're taking, the correct dose. You can take up to two tablets, three times a day."
    },
    {
      "speaker": "PATIENT",
      "text": "Ohh right."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNSURE>So</UNSURE>, so <UNIN/>, there's definitely room for, improvement there. Or, I can prescribe you something stronger, like Naproxen, which is another anti-inflammatory, which can be helpful."
    },
    {
      "speaker": "PATIENT",
      "text": "Mm-hmm."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNSURE>Um</UNSURE>, we can also add in other, painkillers like, Paracetamol, or Codeine. Which might be helpful as well."
    },
    {
      "speaker": "PATIENT",
      "text": "Mm, yeah. I think <UNIN/> is what my mom takes for when she has um, um migraines."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. And I think it's <UNIN/>, certainly worth looking into that, so I can give you a <UNIN/>, prescription for that today. Um, with regards to um, the next few days. It may be worth keeping a headache diary so we can try and work out what's, you know, if there's any triggers which could be causing your headaches to become worse."
    },
    {
      "speaker": "PATIENT",
      "text": "Mm-hmm."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNSURE>And</UNSURE>, and, you know I'd like you to come back and see me, in about uh, a week's time, week to two weeks' time."
    },
    {
      "speaker": "DOCTOR",
      "text": "If you are having <UNIN/>, more frequent episodes of these type of headaches. We can think about giving you medications as, prophylactic. Which basically means, medications to stop you from having these headaches on a regular basis. But we can have that discussion next time."
    },
    {
      "speaker": "PATIENT",
      "text": "Mm, OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. In the meantime if your headaches aren't getting any better, or they're getting worse. Um, you know, I want you to give me a call, or come back and see me sooner. OK?"
    },
    {
      "speaker": "PATIENT",
      "text": "OK. Yeah."
    },
    {
      "speaker": "DOCTOR",
      "text": "So, <UNSURE>if</UNSURE> you're having any problems with your vision, or weakness in your arms and legs, or you're just not feeling very well. Just give me a call, and come back and see me."
    },
    {
      "speaker": "PATIENT",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "All right?"
    },
    {
      "speaker": "PATIENT",
      "text": "Great."
    },
    {
      "speaker": "DOCTOR",
      "text": "Great. Well, have a good day."
    },
    {
      "speaker": "PATIENT",
      "text": "Thank you. You too. Bye!"
    },
    {
      "speaker": "DOCTOR",
      "text": "Bye."
    }
  ],
  "events": null,
  "notes": null
}