{
  "version": "0.0.2+b7c0458e63faab58bab172e6f7831d94465d87c3",
  "timestamp": "2025-07-03T13:34:51Z",
  "model": null,
  "seed": null,
  "id": "4f8183c6-0649-4da4-9588-e7b105318bdc",
  "parentId": null,
  "complete": null,
  "personas": null,
  "scenario": null,
  "turns": [
    {
      "speaker": "DOCTOR",
      "text": "Alex. Ohh. Hello? Hi, can you hear me?"
    },
    {
      "speaker": "PATIENT",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "PATIENT",
      "text": "<UNSURE>Yeah</UNSURE>."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK great. Um how can I help you this morning, sir?"
    },
    {
      "speaker": "PATIENT",
      "text": "Alright, so I've been feeling, I've been feeling kind of uh under the weather for the past four days."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "PATIENT",
      "text": "Um it started with the um, uh sore throat and runny nose, and"
    },
    {
      "speaker": "PATIENT",
      "text": "It's sort of, um, it's sort of going into a cough now. Um, the sort throat is kind of going away, but, um, <UNIN/> I'm starting to cough."
    },
    {
      "speaker": "DOCTOR",
      "text": "Mm-hmm. OK."
    },
    {
      "speaker": "PATIENT",
      "text": "And uh <INAUDIBLE_SPEECH/> kind of uh bad and tired."
    },
    {
      "speaker": "DOCTOR",
      "text": "Sorry to hear that <UNIN/>."
    },
    {
      "speaker": "DOCTOR",
      "text": "Mm. OK. I'm sorry to hear that. Seems like there's a lot going on there. Um so let's start with your, your sore throat first. Um <UNIN/> tell me a bit more about that, if you can."
    },
    {
      "speaker": "PATIENT",
      "text": "Um ,so I, I <UNIN/>, you know I think I, it all started with, uh, this colleague of mine, she just kept sneezing next to me, all the time. I think her kids are catching something from the"
    },
    {
      "speaker": "PATIENT",
      "text": "uh from their kindergarten or something. And uh, you know the it it started as normal sore throat, and uh was quite painful for a couple days, but then it was past."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. OK. And did you have any uh difficulty or pain on swallowing?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um yeah. Yeah it was uh, it was quite painful to swallow, <UNIN/> for one or two days."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "You <UNIN/>, did you manage to have a look at the back of your throat in the mirror?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um no, not really."
    },
    {
      "speaker": "DOCTOR",
      "text": "No. OK you didn't, you didn't notice any abnormal <UNIN/> white spots, redness at the back of your throat?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um"
    },
    {
      "speaker": "PATIENT",
      "text": "No. Um I I didn't think about uh <INAUDIBLE_SPEECH/>."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNIN/> that's OK. That's OK. And you mentioned a runny nose. Um again what kind of discharge is coming out? Is it clear, or is it <UNIN/> a bit more coloured?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah yeah, it's uh it's <UNSURE>clearing up</UNSURE> <UNIN/>."
    },
    {
      "speaker": "PATIENT",
      "text": "Sort of um, <INAUDIBLE_SPEECH/> sort of getting my nose stuffed all the time. It's very had to, uh to get it free."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. You feel quite congested, do you?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah, quite congested."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, fine. Um you also mentioned a cough as well. Can you tell me a bit more about that?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um yeah that started recently, like just uh um maybe yesterday. And um it's uh, it's dry for now, it's it's not very painful but it's sort of there, all the time."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. And is it worse any particular time of the day?"
    },
    {
      "speaker": "PATIENT",
      "text": "Sorry?"
    },
    {
      "speaker": "DOCTOR",
      "text": "Is it, is it worse any particular time of the day? For example in the evenings, night time, mornings?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um"
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/> throughout the day."
    },
    {
      "speaker": "PATIENT",
      "text": "No it's it's um, it's sort of, it's sort of constant. Um I forgot to mention, that um I'm also having uh night sweats."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "Night first, OK."
    },
    {
      "speaker": "PATIENT",
      "text": "<UNSURE>That's</UNSURE>, that's very odd actually. <INAUDIBLE_SPEECH/> makes me a bit tired, um makes my <INAUDIBLE_SPEECH/> uneasy."
    },
    {
      "speaker": "DOCTOR",
      "text": "Mm."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "I can imagine, yes. Uh and this has again, been going on for last uh three four days, has it?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah, yes."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Um right, OK. Have you noticed any fevers or temperatures at all?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um I I had some some fever in the beginning, but it's now sort of uh going down. I I've been taking some Paracetamol and Ibuprofen for that, and uh they, they help."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "That's very sensible. Um very good. Um in terms of your chest otherwise, have you any difficulty breathing, or any pain in your chest?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um so no pain in chest, but uh I noticed that I um um so I feel a bit winded on exertion. So if I I <UNIN/> I haven't been going, going to the gym thus uh, because of that."
    },
    {
      "speaker": "DOCTOR",
      "text": "When you say winded, do you feel, uh do you feel more short of breath would you say, on exertion? Is that when you, OK. Um and and that's mainly on exercise. But when you're resting, there's no problem."
    },
    {
      "speaker": "PATIENT",
      "text": "<INAUDIBLE_SPEECH/> yeah. <INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah, yeah. When when when I'm resting it's OK. So <UNIN/> I've been actually going to work, um sort of managing."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, fine. Just a couple other questions <INAUDIBLE_SPEECH/>, if you don't mind. Any pain in, in your ears at all?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um no."
    },
    {
      "speaker": "DOCTOR",
      "text": "No, you don't feel blocked, or any discharge coming out of your ears?"
    },
    {
      "speaker": "PATIENT",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "PATIENT",
      "text": "No, I don't think so."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, fine. Um what I'm gonna do, I'm just gonna run through a few uh yes no questions, if you if you don't mind, just a review of your systems. Any, any headaches at all?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, yeah, yeah. That that's still, that's still there."
    },
    {
      "speaker": "DOCTOR",
      "text": "Whereabouts are the head, headaches?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um it's sort of general. Uh and uh <UNIN/> they're not, they're not always there, but you know every now and then they will come and go."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. And with those headaches have you had any problems with your, with your eyesight, your vision?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um no."
    },
    {
      "speaker": "DOCTOR",
      "text": "Uh any difficulty with seeing bright lights?"
    },
    {
      "speaker": "PATIENT",
      "text": "No, I don't think so."
    },
    {
      "speaker": "DOCTOR",
      "text": "No, OK. Um and just moving down now, <UNIN/> in terms of any, any feeling nausea or any vomiting?"
    },
    {
      "speaker": "PATIENT",
      "text": "No, none of that."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Tell me about your bowels. Are your bowels working OK?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh yeah, yeah. Think so."
    },
    {
      "speaker": "DOCTOR",
      "text": "You're passing urine OK?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah, yeah."
    },
    {
      "speaker": "DOCTOR",
      "text": "How's your appetite, sir?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah I've been, I've been drinking a lot more than the usual. But uh so <UNIN/> other than that, so <UNIN/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Um and you're eating and drinking, uh you're eating OK otherwise."
    },
    {
      "speaker": "PATIENT",
      "text": "Um maybe a bit less than uh than what I, I would usually have."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Um have you noticed any, any funny rashes at all, on your skin?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um no, no."
    },
    {
      "speaker": "DOCTOR",
      "text": "No. And any general muscle pain or aches, joint pain, <INAUDIBLE_SPEECH/>?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah, yeah. Yeah that's, that sort of started in the past couple days."
    },
    {
      "speaker": "DOCTOR",
      "text": "Yeah, OK. Alright um and uh just having a look at the rest of your history, are you otherwise fit and well? Or do you have any other medical problems I should be aware of?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, so otherwise that, uh, I'm I'm fine. There's um, there isn't anything that I'm taking or, I'm being treated for."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Um"
    },
    {
      "speaker": "PATIENT",
      "text": "<UNSURE>Um</UNSURE>"
    },
    {
      "speaker": "DOCTOR",
      "text": "So you are otherwise fit and well. Uh any, any allergies at all to any medications, I should be aware of?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, no <INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "No, OK. Um"
    },
    {
      "speaker": "DOCTOR",
      "text": "Any family history at all? So anything relevant in the family that I should be aware of? Anything like diabetes, high blood pressure?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, yeah my grandma has diabetes. Um, and, my grandma."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "Your brother?"
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNIN/> you say grandma, sorry my apologies. Grandma, OK. Uh do you know what type of diabetes it is? Is it type one, type two?"
    },
    {
      "speaker": "PATIENT",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "PATIENT",
      "text": "I think <UNIN/>, I think it's type two."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "Um anything else which you think is significant?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah, I, I think um, one of my uh, great grandads had an eczema."
    },
    {
      "speaker": "DOCTOR",
      "text": "Excellent, OK. OK. Um just moving on to what we <UNIN/> social history, just to get to know you a bit more as a person. Tell me, who do you live with at home?"
    },
    {
      "speaker": "PATIENT",
      "text": "Ohh um, I live alone."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. And you said you're working at the moment?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah, yeah."
    },
    {
      "speaker": "DOCTOR",
      "text": "What do you do for work?"
    },
    {
      "speaker": "PATIENT",
      "text": "I'm an, I'm an accountant."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, and how's your work going at the moment? Uh over the last, has it, has it been affecting your work?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, a little bit. I've been a bit slower. And you know, it's uh, it's, it's a bit of a stressful period just around the um, end of the year. Right."
    },
    {
      "speaker": "DOCTOR",
      "text": "Mm, OK. Is that stress, is that affecting your um, your mood at all any, in any way?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, no I think I think it's, it's the, you know it's the good kind of stress. It's um, it's good work."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/> OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "Well <UNIN/> if there's anything you want to talk to me about, you can always come see me about your mood, um stress, anxiety. <INAUDIBLE_SPEECH/> happy to help."
    },
    {
      "speaker": "PATIENT",
      "text": "I don't know. I, I like my job. It's just you know, it's a bit more work than usual."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. OK. And just very briefly, just in terms of smoking uh, do you smoke at all?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, yeah occasionally, you know, cigars and things on company parties."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK so not, not regular. Um and what about alcohol?"
    },
    {
      "speaker": "PATIENT",
      "text": "No."
    },
    {
      "speaker": "PATIENT",
      "text": "Um, occasionally yeah I would have some. I'm, I'm not a very big drinker."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNIN/> socially with work."
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah."
    },
    {
      "speaker": "DOCTOR",
      "text": "Um OK. Um so um"
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNIN/> just having listened to your story, um uh really just to summarize you know since the last four days you've been feeling generally quite unwell, sore throat, runny nose, bit of a dry cough, bit of muscle pain, weakness."
    },
    {
      "speaker": "DOCTOR",
      "text": "Um had initial fever, but now settled. Um I don't think there's a lot to worry about. I think you probably have, you know a bit of a viral, what we say viral illness, maybe a viral upper respiratory tract infection, or maybe early signs of a flu."
    },
    {
      "speaker": "DOCTOR",
      "text": "Um these normally last about seven to days and just gets better really, um over time. But things you can do to really help yourself, um is get plenty of rest. I'd probably advise you taking a day or two off work if you can. Um"
    },
    {
      "speaker": "DOCTOR",
      "text": "Making yourself, <UNIN/> pushing fluids and make yourself well-hydrated. Continue with the regular Paracetamol, Ibuprofen. Um and and you should see how things go, really. Um if next week you're still not better, I'd like you to come back and see me."
    },
    {
      "speaker": "DOCTOR",
      "text": "Um is that clear? Does that, does that make, does that make <UNIN/>"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah, yeah, that's that's <INAUDIBLE_SPEECH/>, it makes sense. Uh, I think <INAUDIBLE_SPEECH/> I'll take a couple days off, and see how it goes."
    },
    {
      "speaker": "DOCTOR",
      "text": "Yeah, <UNSURE>yeah</UNSURE>."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNIN/> and things to look out for if you're really not getting better, if you if you have a high fever, or your breathing is becoming a bit more labored, or chest pain, I'd like you to come back and see me much sooner, give me a call. Um and <INAUDIBLE_SPEECH/> we can help you out. OK?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah."
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah, yeah I understand. Uh, I'll uh, I'll take care."
    },
    {
      "speaker": "DOCTOR",
      "text": "Great. Have a great day. Good luck with your work. Thank you. <UNSURE>Bye bye. Bye bye.</UNSURE>"
    },
    {
      "speaker": "PATIENT",
      "text": "Thank you. Thank you. You too. Bye bye."
    }
  ],
  "events": null,
  "notes": null
}