{
  "version": "0.0.2+b7c0458e63faab58bab172e6f7831d94465d87c3",
  "timestamp": "2025-07-03T13:34:51Z",
  "model": null,
  "seed": null,
  "id": "8f52f7c4-a1ac-4ef1-94b2-4c9949191593",
  "parentId": null,
  "complete": null,
  "personas": null,
  "scenario": null,
  "turns": [
    {
      "speaker": "PATIENT",
      "text": "Hello?"
    },
    {
      "speaker": "DOCTOR",
      "text": "Hello? Hello. Um, before I go any further, can I confirm your name and your date of birth?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh, yeah. Uh my name is April, and I'm fifty."
    },
    {
      "speaker": "DOCTOR",
      "text": "You're fifty, OK. April, how can I help you this afternoon?"
    },
    {
      "speaker": "PATIENT",
      "text": "Well I've just been having this like, cough, for quite a few days. And my nose is running. Um and it's just been super annoying, and it's not going away."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>, OK. When did it all start?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh I think it started like maybe, a bit less than a week ago. Like maybe, maybe five or six days ago."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. And you mentioned a couple of things there. You mentioned a cough. You mentioned a bit of a runny nose. Is that right?"
    },
    {
      "speaker": "PATIENT",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Let's focus on your cough first. Can you tell me a bit more about your cough?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh, it's just so continuous. It's really, really frustrating. It's quite dry. And it's just all day, it like keeps me up at night as well, which is really annoying."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. So it's a dry cough. So you're not bringing up any <UNIN/>, you're not bringing up any mucky, ohh I can hear that, yeah. Um you're not bringing up any uh, mucky phlegm or anything like that."
    },
    {
      "speaker": "DOCTOR",
      "text": "No, OK. So it keeps you up at night. Um you mentioned uh the cold symptoms as well, the runny nose. Do you have a <UNIN/> do you have a sore throat at all?"
    },
    {
      "speaker": "PATIENT",
      "text": "I mean, apart from, I mean the coughing is giving me a sore throat. But it's not like, you know not more than, than that. You know just, just my throat is irritated from coughing. But it's not like, it's not that bad when I swallow or anything."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "Right. Do you have any uh, <UNIN/> how are your ears? Do you ears feel blocked or?"
    },
    {
      "speaker": "PATIENT",
      "text": "No.They feel OK, actually. Yeah. <INAUDIBLE_SPEECH/>. Nothing, nothing on the ears."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNIN/> No pain, no discharge coming from your ears."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, alright. Um fine. In terms of your breathing, how is your <UNIN/>, how's your chest? Is your breathing more labored?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, I don't think so. Like, I guess I get laboured when I'm coughing and I can't breathe. But I, not, yeah, not, I, I don't think so. Not really."
    },
    {
      "speaker": "DOCTOR",
      "text": "Day to day when you walk around, uh you don't feel breathless do you?"
    },
    {
      "speaker": "PATIENT",
      "text": "I don't feel restless. No, <INAUDIBLE_SPEECH/> I feel you know, generally tired."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. OK."
    },
    {
      "speaker": "PATIENT",
      "text": "So like, yeah, but <UNIN/> not, not anything special with my chest."
    },
    {
      "speaker": "DOCTOR",
      "text": "Any pain in your chest?"
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "PATIENT",
      "text": "No not, not that either."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. You mentioned feeling tired. Um have you felt feverish at all? Have you had a temperature?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um I've been having like, like shivers, even when I'm in, when I'm in bed."
    },
    {
      "speaker": "PATIENT",
      "text": "You know like, when you, when you go to sleep and, and you feel like I I should be warm. But I'm still, still you know, shivering a little bit."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "PATIENT",
      "text": "But I haven't taken my temperature, so I'm not a hundred percent sure if I had a fever. But it feels like I probably did. 'Cause I was just, I was next to my boyfriend. And he was completely warm and totally fine. And I just like couldn't stop shivering. And kept adding more sweaters on, and I was still cold."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. OK. OK. Alright. Um, fine. And in terms of any other symptoms, so have you had any nausea? Have you had any vomiting?"
    },
    {
      "speaker": "PATIENT",
      "text": "No. No, no nausea. No vomiting. Like, um yeah, <UNIN/> nothing like that."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "How's your appetite?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, I mean it's OK. I, at the beginning, like when I was starting to have the <UNIN/>, the <UNIN/>, the coughing and stuff."
    },
    {
      "speaker": "PATIENT",
      "text": "Um, I had a little bit of diarrhea. Um but, but it didn't, it didn't cut my appetite or anything. I just like, my stomach wasn't feeling great."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Has that got better now, the diarrhea?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah, yeah. It got better. It was only like the first, like it started at the same time as the cough started. And then it stopped. So I thought everything would be fine. But then the cough just kept going."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "OK fine. Um, any problems with your waterworks at all?"
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "PATIENT",
      "text": "With my what?"
    },
    {
      "speaker": "DOCTOR",
      "text": "Uh your <UNIN/> your waterworks, your urine."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "PATIENT",
      "text": "Ohh. Uh, no. No no, it's fine."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/> you're passing urine OK. You're drinking plenty of fluids, and passing urine OK."
    },
    {
      "speaker": "PATIENT",
      "text": "No. I, I drank loads of water, when I started having the diarrhea. Now that it stopped, I just went back to normal."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, alright. Um in terms of any other thing, do you notice any, any find any skin rashes, or um problems with your muscles or joints?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh <UNIN/> like my, you know when I had the, when I was telling you I had like the, I had chills, and I was really cold. My <UNSURE>muscle </UNSURE> was really hurting."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNSURE>Yeah</UNSURE>."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. <UNIN/>"
    },
    {
      "speaker": "PATIENT",
      "text": "Sometimes I do pilates. But like, it's hurting me so much at the moment. Um so, to be honest, all I feel like doing is just lying in bed."
    },
    {
      "speaker": "DOCTOR",
      "text": "Right."
    },
    {
      "speaker": "DOCTOR",
      "text": "Right, OK. OK. I'm sorry. That must be very difficult for you. <INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah, <UNSURE>right</UNSURE>. Especially like in my arms, my legs, like just everywhere basically."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNIN/> quite lethargic and weak, you mentioned. <UNSURE>Um</UNSURE>, OK. And um, April are you normally otherwise fit and well?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah, pretty much."
    },
    {
      "speaker": "PATIENT",
      "text": "Am I normally what?"
    },
    {
      "speaker": "DOCTOR",
      "text": "Uh fit and well. So do you have any other medical history?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh, well I have type two diabetes. And I have quite high blood pressure."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. And what do you take for your blood pressure? Any, or what what medications do you take on a regular basis, if you don't mind saying?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um I take <UNIN/> Metformin for the diabetes. And I take Lisinopril for the high blood pressure."
    },
    {
      "speaker": "DOCTOR",
      "text": "Yep."
    },
    {
      "speaker": "DOCTOR",
      "text": "Zinopril. OK, fine. Any allergies at all, to medications?"
    },
    {
      "speaker": "PATIENT",
      "text": "No. No allergies."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "No, OK. Regarding any family history, is there anything I should be aware of?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh my dad also has type two diabetes. But I think that's it."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, alright. Who's looking after your diabetes? Is there anyone, is there a doctor in a hospital, who looks after your diabetes?"
    },
    {
      "speaker": "PATIENT",
      "text": "<INAUDIBLE_SPEECH/> I just regularly go see a doctor."
    },
    {
      "speaker": "PATIENT",
      "text": "Um, that just checks up on it. Same with the high blood pressure. Like I, I have it under control. And since I've started taking this medication, I've just been like regularly checking that it, it's under control."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "Right, excellent. And in terms of your social situation, who lives at home with you?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh just, it's just me and my partner."
    },
    {
      "speaker": "DOCTOR",
      "text": "lives OK, um fine. Is your partner well at the moment?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah he has none of this. Like he's just going ahead like, like <UNIN/> nothing. Like I was a bit worried that I would pass it to him but, <INAUDIBLE_SPEECH/> not uh, diarrhea, nothing, fine."
    },
    {
      "speaker": "DOCTOR",
      "text": "Right, OK. <UNSURE>So he</UNSURE>"
    },
    {
      "speaker": "DOCTOR",
      "text": "Go away, he's got away with it, at the moment. OK. And uh, are you working at the moment, April?"
    },
    {
      "speaker": "PATIENT",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh, yeah I am working. But the, the first day I skipped. <UNIN/> because I was feeling just too shit. Um, but then, I just felt like had to go back, 'cause I had so much to do. <UNIN/> So I've been going in. But it's not been fun."
    },
    {
      "speaker": "DOCTOR",
      "text": "Yeah."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "No, I can imagine. What is it that you do for work?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh, I am a developer."
    },
    {
      "speaker": "DOCTOR",
      "text": "Ohh, so you work in the IT field. OK. <INAUDIBLE_SPEECH/> IT field. Right, OK. Uh"
    },
    {
      "speaker": "PATIENT",
      "text": "<UNIN/> yeah. Work in IT."
    },
    {
      "speaker": "PATIENT",
      "text": "<INAUDIBLE_SPEECH/> not too active a job. Uh, yeah."
    },
    {
      "speaker": "DOCTOR",
      "text": "No. Has it been quite stressful recently?"
    },
    {
      "speaker": "PATIENT",
      "text": "Not more than usual. I don't think it's related to stress. Like I, I don't feel like I've had a particularly hard time at work that way. Um"
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "The reason I ask is sometimes"
    },
    {
      "speaker": "PATIENT",
      "text": "<UNIN/> I've been able to take a day off to try and recover. So yeah, I don't think it's related."
    },
    {
      "speaker": "DOCTOR",
      "text": "Sure. <UNIN/> reason I ask is because sometimes stress can really affect your immune system. Um but uh it's good to know you're you're you're not feeling stressed."
    },
    {
      "speaker": "DOCTOR",
      "text": "Um, do you smoke at all, April?"
    },
    {
      "speaker": "PATIENT",
      "text": "I used to, but I've stopped for about six months now."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Um and what about alcohol?"
    },
    {
      "speaker": "PATIENT",
      "text": "I mean, yeah I, I don't think I drank that much. Like, I I don't really know how you count the units. So I guess like I don't drink more than like, like, let's say three evenings a week? And I rarely get like properly drunk, or anything."
    },
    {
      "speaker": "DOCTOR",
      "text": "And what is it that you drink?"
    },
    {
      "speaker": "PATIENT",
      "text": "Wine, mostly."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNSURE>The wine</UNSURE>. How much do you drink on those nights?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh, I'd say like maybe two or three glasses."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. So um, yeah so you're probably just about under the limit of um, the recommended limit."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "Something <UNIN/> think about, just in terms of your blood pressure and diabetes, maybe something that you can maybe cut down on if you can."
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah? <INAUDIBLE_SPEECH/> I should cut down on it."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/> really ideally, the the the right answer is to cut down completely. But so in practice I know that's not realistic. So maybe for the first few weeks, why don't you cut down to two glasses a week. And then, one week thereafter"
    },
    {
      "speaker": "DOCTOR",
      "text": "Um and if you are coping OK, then you can maybe try and cut down altogether."
    },
    {
      "speaker": "PATIENT",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK? Just something for you to think about. Um, right so uh just <UNIN/> as we wrap up really, um April I think based on your story, I think uh essentially I think you're, you're going through a bit of a bit of a viral illness. Um, I don't think there's anything to worry about."
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah."
    },
    {
      "speaker": "DOCTOR",
      "text": "You know you've had a bit of a cough, bit of a runny nose, feeling quite weak and lethargic."
    },
    {
      "speaker": "DOCTOR",
      "text": "I'm hoping that, you know, you're probably over the worst of it now. It's been five days. I'm hoping you're maybe going to get better in the next couple of days. It normally lasts for about a week to ten days."
    },
    {
      "speaker": "PATIENT",
      "text": "What, what should I do if it just keeps going on and on? Like if it's still going on in, in say four days?"
    },
    {
      "speaker": "DOCTOR",
      "text": "Yeah, absolutely. So, you know things you can do to help yourself in the meantime is to, you know get some nice, good rest."
    },
    {
      "speaker": "DOCTOR",
      "text": "Drink plenty of fluids. Keep yourself well-hydrated. You can take regular Paracetamol."
    },
    {
      "speaker": "DOCTOR",
      "text": "If you feel like you're still not getting any better in two to three days, it's probably worth coming back to see me again. We can check you over."
    },
    {
      "speaker": "DOCTOR",
      "text": "And if you are still feeling feverish, um and your cough isn't getting any better, then we may look to give you some antibiotics for your chest. <UNIN/> some of the uh uh common source of infection. Um"
    },
    {
      "speaker": "PATIENT",
      "text": "Do you think I should keep going to work? Or do you think I should just"
    },
    {
      "speaker": "DOCTOR",
      "text": "Yeah so I think you know <UNIN/>, really I think it depends on you. <UNIN/> it's um if you are coughing, then there is a theoretical, you know risk that you're maybe slightly infectious still. So I would say maybe take a day or two off work, if you can."
    },
    {
      "speaker": "DOCTOR",
      "text": "Uh and get some good bed rest. Um and maybe think about work early next week."
    },
    {
      "speaker": "PATIENT",
      "text": "OK. OK. Thank you."
    },
    {
      "speaker": "DOCTOR",
      "text": "But um, if your cough isn't getting any better, or your breathing is getting worse, I want you to come back and see me sooner. OK?"
    },
    {
      "speaker": "PATIENT",
      "text": "OK. But otherwise, I don't need to worry."
    },
    {
      "speaker": "DOCTOR",
      "text": "No no no <UNIN/>, nothing to worry about otherwise."
    },
    {
      "speaker": "PATIENT",
      "text": "OK. Alright. Thank you very much."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Well, have a good day. Appreciate it."
    },
    {
      "speaker": "PATIENT",
      "text": "Thank you. Bye!"
    }
  ],
  "events": null,
  "notes": null
}