{
  "version": "0.0.2+b7c0458e63faab58bab172e6f7831d94465d87c3",
  "timestamp": "2025-07-03T13:34:51Z",
  "model": null,
  "seed": null,
  "id": "fa0e24b2-7415-4826-916b-d00ed2a154ad",
  "parentId": null,
  "complete": null,
  "personas": null,
  "scenario": null,
  "turns": [
    {
      "speaker": "DOCTOR",
      "text": "Hi, good morning!"
    },
    {
      "speaker": "PATIENT",
      "text": "Hello there!"
    },
    {
      "speaker": "DOCTOR",
      "text": "Hi there, this is uh this is Doctor Dean <UNIN/> from <INAUDIBLE_SPEECH/> ."
    },
    {
      "speaker": "PATIENT",
      "text": "Hello there? Um, I'm wondering if you can help me today."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, <UNIN/> sure, <UNIN/> I'll try. Before we start, could I please confirm your full name and date of birth?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yes, it's Sarah Smith, and it's the second of November, um, nineteen ninety two."
    },
    {
      "speaker": "DOCTOR",
      "text": "That's great! Thank you, sir. So are you in a private place where you are OK to speak at the moment?"
    },
    {
      "speaker": "PATIENT",
      "text": "I am indeed, yes."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, so tell me what's been going on."
    },
    {
      "speaker": "PATIENT",
      "text": "OK. I, I've really not been feeling so well at all recently. I, I've been struggling with fever for the past week. Yeah, I would say it's <UNIN/> about seven days ago. I'm just, I'm really hot and sweaty all the time, and just generally not feeling good."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, alright, sorry to hear that. Now, um, uh, along with this fever and this <UNIN/> any other symptoms at all?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, I'd say that I'm aching all over really, my muscles are really aching. I'm feeling quite nauseous, uh, so I've not been able to eat very much, and I have been drinking but it's been quite a small amount."
    },
    {
      "speaker": "PATIENT",
      "text": "Um, and, yeah, just generally quite tired and unwell. I'm sweating during the the the night, I'm quite cold."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, all right. Um, and um, so <UNIN/> you're having periods of when you're feeling hot, and also periods when you're feeling cold as well."
    },
    {
      "speaker": "PATIENT",
      "text": "Yes, yes, quite interchangeable, not really a pattern to it."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, uh, and have you been taking your medication?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh, I've been trying to, like, take ibuprofen and paracetamol just to from over the counter, but it's not really helping, just been taking the recommended dose every day of those."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNSURE>Sure</UNSURE>, and when you say it's not helping, is it bringing the temperature down at all?"
    },
    {
      "speaker": "PATIENT",
      "text": "Perhaps slightly, yes, but I'm still experiencing these symptoms, so, it does take the edge off a bit."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, alright. And can I just double check have you gotten any cough or cold or sore throat or <UNIN/> anything like that?"
    },
    {
      "speaker": "PATIENT",
      "text": "Mmm, not those sort of symptoms, really. Um"
    },
    {
      "speaker": "DOCTOR",
      "text": "But which <INAUDIBLE_SPEECH/> are you getting, other than the ones you've already mentioned to me?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, so, I have a habit"
    },
    {
      "speaker": "PATIENT",
      "text": "that it's mainly just the sweating, really, and the and the nausea, uh, that's overtaking all all day and, uh, the aching muscles all over."
    },
    {
      "speaker": "DOCTOR",
      "text": "Sure. Have you have you had any ear pain <UNIN/>?"
    },
    {
      "speaker": "PATIENT",
      "text": "Mmm, no, my ears are fine, actually. I haven't had any problems with my ears."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, um, just, I just need to check for any other causes of infection in the body. So I'm gonna go through some, um, kind of systemic questions. Have you had any diarrhoea?"
    },
    {
      "speaker": "PATIENT",
      "text": "And <UNIN/> not, not really no, not that I can find."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Have you got any neck stiffness at all?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, no. My neck's, my neck's been fine."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "Alright. Um, do you have any headache?"
    },
    {
      "speaker": "PATIENT",
      "text": "Not more than usual, no. Just like the, general headaches but not, just from staring at the screen. <UNIN/> No migraines, or anything."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, so, you know your normal headache, where is that, in the back of your head or the front of the head?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uum, it's quite centralized over, over the head."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. <UNIN/> and how long have you been having that for?"
    },
    {
      "speaker": "PATIENT",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "PATIENT",
      "text": "It's something that I've struggled with through, years really, just related to a screen use, or, uum, like changes in weather patterns. Yeah, high pressure days, sometimes I struggle with migraines, and headaches."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Um, have you got any rash on your body anywhere at all?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh, I haven't noticed any rashes, no."
    },
    {
      "speaker": "DOCTOR",
      "text": "Uh, any joints swollen or tender or sore?"
    },
    {
      "speaker": "PATIENT",
      "text": "Mmm, not really. I mean, I, I often have problems with back pain but <UNIN/> not really any other joints."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, alright."
    },
    {
      "speaker": "PATIENT",
      "text": "<UNSURE>Any</UNSURE> problems?"
    },
    {
      "speaker": "DOCTOR",
      "text": "Alright, <UNIN/> and, um, have you got any kind of symptoms down below when you're passing urine?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh, no,  there's been no problems there."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Any painful urination at all?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh, not at all, no."
    },
    {
      "speaker": "DOCTOR",
      "text": "Are you passing urine more often than normal?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh, <UNIN/> I  don't think so, no it's been fairly regular."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Have you been abroad anywhere recently?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yes, I have actually."
    },
    {
      "speaker": "DOCTOR",
      "text": "Where have you been?"
    },
    {
      "speaker": "PATIENT",
      "text": "I went to Vietnam. Uh, I came back four weeks ago now."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "Uh, and, um, uh, did you take malaria preventative medication when you went out there?"
    },
    {
      "speaker": "PATIENT",
      "text": "I did, yes."
    },
    {
      "speaker": "DOCTOR",
      "text": "Which one did you take?"
    },
    {
      "speaker": "PATIENT",
      "text": "Ooo, I can't remember now, off the top of my head."
    },
    {
      "speaker": "DOCTOR",
      "text": "Was it a weekly tablet or a daily tablet?"
    },
    {
      "speaker": "PATIENT",
      "text": "I think it was daily."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, um, and was it one tablet or was it another one that you would take on top of the first one?"
    },
    {
      "speaker": "PATIENT",
      "text": "I think it was, uh another one that I took on top of the first one."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "And, and what were you doing out in Vietnam? Was it just seeing the cities or going through villages or hiking? What what kind of activities were you doing?"
    },
    {
      "speaker": "PATIENT",
      "text": "It was quite <UNIN/> really,  'cause we were there for a few weeks, and we toured to, uh, several different parts of the country, and uh, the countryside and some cities as well."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Uh, and um, did you do any kind of, were you in rivers or things like that? Were you, you know, <UNIN/> how adventurous were you?"
    },
    {
      "speaker": "PATIENT",
      "text": "I'm sorry, could you repeat that? I missed that."
    },
    {
      "speaker": "DOCTOR",
      "text": "Where you going out into the rivers? Were you going on beaches? I mean how adventurous was your trip?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yes, it was quite adventurous. We were sort of trekking and, um, cycling, uh, through the farmland and, um, seeing how people lived in a day-to-day life in, in, in farmland."
    },
    {
      "speaker": "DOCTOR",
      "text": "Right, OK. Um, thank you for sharing that with me. Now, do you have, um, any other illnesses at all, in the past?"
    },
    {
      "speaker": "PATIENT",
      "text": "Mmm, as I said I've, I've been struggling with back pain <UNSURE>for quite a while</UNSURE>,  but I haven't really had any, uh, major illnesses in the past, <UNSURE>I can think of</UNSURE>."
    },
    {
      "speaker": "DOCTOR",
      "text": "And that back pain have you, um, have you seen anyone about that?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yes, yeah, I'm under a physiotherapist at the moment for that."
    },
    {
      "speaker": "DOCTOR",
      "text": "Have they, have they give you any kind of diagnosis at all?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, they've said that it's, <UNIN/> u,h related to long periods of time sitting at a desk, and just, uh, bad posture. So mainly the  exercises are focused on improving posture and, and to strengthen the muscles in the back."
    },
    {
      "speaker": "DOCTOR",
      "text": "Alright um, are there any illnesses in your family at all?"
    },
    {
      "speaker": "PATIENT",
      "text": "Hmm, the main one would be, um, heart attack. My, my father passed away of that."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNSURE>I'm sorry to hear that</UNSURE>. Um, how old was he when that happened?"
    },
    {
      "speaker": "PATIENT",
      "text": "in his <UNSURE>sixties</UNSURE>."
    },
    {
      "speaker": "PATIENT",
      "text": "Um, sixty eight, I think. Yeah."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Um, are you on any medication at all?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh, just <UNSURE>Seroxat</UNSURE>."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Uh, <UNIN/> do you have any allergies <UNSURE>at all</UNSURE>? <UNIN/> medication?"
    },
    {
      "speaker": "PATIENT",
      "text": "No, I've just really pollen allergy. That's all I have."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, so hay fever."
    },
    {
      "speaker": "PATIENT",
      "text": "Yes, yeah, just hay fever."
    },
    {
      "speaker": "DOCTOR",
      "text": "Alright. Um, are you, um, you're working at the moment?"
    },
    {
      "speaker": "PATIENT",
      "text": "Uh, I am, yes."
    },
    {
      "speaker": "DOCTOR",
      "text": "What do you work at?"
    },
    {
      "speaker": "PATIENT",
      "text": "I work as a nurse."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, all right. Um, and, um, you're up to date with all the vaccinations, Hepatitis B, and that kind of thing?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yes, indeed. Yeah."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "PATIENT",
      "text": "But I'm, I'm really struggling quite a lot at work at the moment. It's been quite difficult, feeling so, uh, tired all the time."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNSURE>So, I can</UNSURE> <UNIN/>."
    },
    {
      "speaker": "DOCTOR",
      "text": "Sure, OK. Um, and, are you a, uh, are you a smoker at all?"
    },
    {
      "speaker": "PATIENT",
      "text": "No, I'm not."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, and ohh do you drink much alcohol?"
    },
    {
      "speaker": "PATIENT",
      "text": "Mmm, moderate alcohol intake. Yeah, I don't drink too much."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, and how much kind of physical exercise do you do normally?"
    },
    {
      "speaker": "PATIENT",
      "text": "I try and do, uh, some moderate physical exercise a few times a week."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, that's good, alright, um, so, um"
    },
    {
      "speaker": "DOCTOR",
      "text": "What, uh, I think we're gonna need to do is we're gonna need to bring you into one of our clinics. <UNSURE>Examine</UNSURE> <UNIN/>, and we're gonna need to arrange some blood tests as well."
    },
    {
      "speaker": "PATIENT",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, um, so, what what I want to do is, the first question I have in my mind is that we need to find a reason for why you've got this <UNIN/> fever and these symptoms, because there's no apparent reason from what you've told me."
    },
    {
      "speaker": "PATIENT",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "There's no, uh, when someone has got fever and sweats, we want to find out have they got chest infection, have they got a throat infection?"
    },
    {
      "speaker": "DOCTOR",
      "text": "Um, and if we can't find a focus of infection, then that's something, that, that's an outstanding question that needs to be answered, OK?"
    },
    {
      "speaker": "DOCTOR",
      "text": "Um, the second thing, second factor, is that you've recently come from, uh, Vietnam."
    },
    {
      "speaker": "PATIENT",
      "text": "<UNSURE>OK</UNSURE>."
    },
    {
      "speaker": "DOCTOR",
      "text": "And you've had exposure to rural areas. And we need to think about things like malaria or other exotic infections as well. So, um, you're probably gonna need some blood tests."
    },
    {
      "speaker": "DOCTOR",
      "text": "After you've been seen by somebody."
    },
    {
      "speaker": "DOCTOR",
      "text": "Um, now, the urgency of those blood tests depends partly on what we find when we examine you, which is why we're going to go, go for the examination first."
    },
    {
      "speaker": "DOCTOR",
      "text": "You <UNIN/> come into one of our clinics in central London, that's one option, and then the the GP there who examines you can then decide on how urgent the blood tests and things are going to be."
    },
    {
      "speaker": "PATIENT",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "Or, if it's inconvenient for you to come into central London because you <UNIN/> you're living further out, you could actually just attend a local A and E."
    },
    {
      "speaker": "DOCTOR",
      "text": "I'm going to type up what my thought process is and what kind of test I think you need in the notes for this appointment, so you could show that to them at reception."
    },
    {
      "speaker": "DOCTOR",
      "text": "Um, I'll be asking for something called thick and thin blood films, to check for malaria."
    },
    {
      "speaker": "DOCTOR",
      "text": "And inflammatory markers and things like those, <UNIN/> technical terms, but they'll understand what that, what I'm talking about."
    },
    {
      "speaker": "DOCTOR",
      "text": "But, um, I, I don't think you can go into work, uh, until we've sorted this out. And we, we, we need to sort this out sooner rather than later."
    },
    {
      "speaker": "PATIENT",
      "text": "OK. <UNIN/> That sounds great. Thank you so much for your help. I, I think, yeah, I can come straight into central London today to get that sorted."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, fine, so what I'm going to do is I will send a message to one of our admin team members asking them to book you in."
    },
    {
      "speaker": "DOCTOR",
      "text": "And if you can ring the number that I leave in your consultation notes, after a few minutes, and then they'll slot you in, and then we can sort things out from there. OK?"
    },
    {
      "speaker": "PATIENT",
      "text": "That's brilliant. Thank you very much."
    },
    {
      "speaker": "DOCTOR",
      "text": "Alright then, OK. Take care then. All the best."
    },
    {
      "speaker": "PATIENT",
      "text": "Goodbye."
    },
    {
      "speaker": "DOCTOR",
      "text": "Bye."
    }
  ],
  "events": null,
  "notes": null
}