{
  "version": "0.0.2+b7c0458e63faab58bab172e6f7831d94465d87c3",
  "timestamp": "2025-07-03T13:34:52Z",
  "model": null,
  "seed": null,
  "id": "acc7e482-d72b-4ab3-a500-411bda7bcf39",
  "parentId": null,
  "complete": null,
  "personas": null,
  "scenario": null,
  "turns": [
    {
      "speaker": "DOCTOR",
      "text": "Hi there. I'm Doctor Smith from Babylon."
    },
    {
      "speaker": "PATIENT",
      "text": "Hi."
    },
    {
      "speaker": "DOCTOR",
      "text": "Hi there. Can you just confirm your name, date of birth, and the first line of your address, first of all please?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah. Uh, my name <UNSURE>is</UNSURE> Valerie <UNSURE>Cole</UNSURE>. My date of birth is the nineteenth of September, nineteen ninety three."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNSURE>My name's</UNSURE> <INAUDIBLE_SPEECH/>."
    },
    {
      "speaker": "PATIENT",
      "text": "My address is, uh, sixty four, Cliveden Place, in, South Wimbledon."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Are you in a private place where you can have a confidential consultation today?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yes I am, yeah."
    },
    {
      "speaker": "DOCTOR",
      "text": "What can I do for you?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, I've been feeling really anxious over the past few months. Um, I just get really nervous every morning about leaving the house, and it's started to really worry me, and just add up, and build up on that anxiety. And I just didn't know, who to talk to or, so I wanted to check with my GP."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Do you mind just telling me a bit more about, when it started? Do you think there's something which changed <UNSURE>in your</UNSURE> life <UNSURE>at</UNSURE> that time?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, I guess so, I think um, I would say maybe about two months or so, I've been feeling like this, and that probably coincides with, me starting a new job, um."
    },
    {
      "speaker": "PATIENT",
      "text": "Which <UNSURE>I</UNSURE> <UNIN/>, I would say it's quite <UNIN/>, I mean every job is stressful, <UNSURE>and</UNSURE> when you first start, but it's been really stressful I think over the past two months, definitely."
    },
    {
      "speaker": "DOCTOR",
      "text": "What's your job?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, so I work for a, a, a fashion retailer, in um, the head office team, and it's just a brand new sector. I've never worked in retail before, my boss is not very nice to me and <UNSURE>I don't</UNSURE>."
    },
    {
      "speaker": "PATIENT",
      "text": "But I also think that, it's just been, I just really dread, going there. I just hate, speaking to her, I hate like seeing everyone and, really worried about whether I'm doing well or not."
    },
    {
      "speaker": "PATIENT",
      "text": "And it's really <UNSURE>impacting</UNSURE> on like, on the rest of my life, like my sleep and stuff like that."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. So, um, just day-to-day, tell me, from the start of your day, how it affects you. You said <UNSURE>that</UNSURE> you, you dread going to work."
    },
    {
      "speaker": "DOCTOR",
      "text": "How, how does it affect you, in terms of like your sleep at night, and things like that?"
    },
    {
      "speaker": "PATIENT",
      "text": "<UNSURE>Right</UNSURE>."
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah, <UNSURE>this is</UNSURE> really so, I, I, I've, as I say like, I don't want to go to work in the morning, so I just find no way of, I can't get out of bed."
    },
    {
      "speaker": "PATIENT",
      "text": "But it's also because, when I leave I just, when I've left work, I just feel so stressed and so worried about everything I've done, I can't get to sleep for hours and hours and hours. So I."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. So <UNSURE>what time</UNSURE>, what time do you go to bed at night-time?"
    },
    {
      "speaker": "PATIENT",
      "text": "About ten, eleven, probably."
    },
    {
      "speaker": "DOCTOR",
      "text": "And what time do you get to sleep?"
    },
    {
      "speaker": "PATIENT",
      "text": "Not for ages, I'm, I'm lying awake all night"
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. And, when you eventually get to sleep, do you wake up with your alarm in the morning, or does something else wake you up, before then?"
    },
    {
      "speaker": "PATIENT",
      "text": "<UNSURE>Mmm</UNSURE>."
    },
    {
      "speaker": "PATIENT",
      "text": "So I find my, my heart kind of racing, and then I'm just like panicking that I'm gonna be late, and that that's gonna make work even more stressful. So I do have an alarm, but I find myself waking up before that, 'cause I'm just my heart is racing. And actually the other day, I was just like, I was lying in bed and I really thought my heart was racing so much, I thought I was gonna have a heart attack in the morning."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. And, so how many hours sleep do you think you get a night?"
    },
    {
      "speaker": "PATIENT",
      "text": "<UNIN/>, I just, I can't even tell because I feel like I'm, even when I'm in sleep it's such a shallow sleep, but maybe, three, four hours, I'm getting now."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. And, what about your eating patterns, any change in how you're eating, or whether <UNSURE>you, your appetite's</UNSURE> changed?"
    },
    {
      "speaker": "PATIENT",
      "text": "Probably, not, <UNSURE>significant</UNSURE> changes maybe. No I wouldn't say that, I wouldn't say that I'm eating like, much differently. <UNSURE>Ohh that</UNSURE>, I probably have more chocolate than normal, just because I feel, so down."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. You're eating <UNSURE>regularly otherwise</UNSURE>?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah, <UNIN/>."
    },
    {
      "speaker": "DOCTOR",
      "text": "<UNSURE>OK</UNSURE>. And, you told me about the palpitations, just tell me a bit more about that."
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah, So <UNSURE>um</UNSURE>, it's, it's usually kind of like, when I realise in the morning that, either um, I feel like I'm gonna be late, because I've like overslept 'cause I'm so tired."
    },
    {
      "speaker": "PATIENT",
      "text": "Um, or I wake up in a panic thinking I am gonna be late so, it's just kind of like, just a constant like, rapid heart beating. It's <UNSURE>just</UNSURE> really, really stressful. I don't know if it's, stress or if, <UNIN/>,  or I did think it was like, a heart problem <UNSURE>really</UNSURE> actually."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "DOCTOR",
      "text": "Does it feel like a regular fast beat, or an irregular, beat?"
    },
    {
      "speaker": "PATIENT",
      "text": "Irregular, I think."
    },
    {
      "speaker": "DOCTOR",
      "text": "And how long do you think it lasts for when you get it?"
    },
    {
      "speaker": "PATIENT",
      "text": "Ohh it can be anything, I think <INAUDIBLE_SPEECH/> couple of minutes, or the other day I was actually just, sort of lying there for like, holding my hand on my chest for like ten <UNSURE>minutes</UNSURE>."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Is that something that you've had before this, or is that a new thing?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah, but I would say this is only in the past. Sort of like, couple of months as I say that I've been, experiencing this."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Any chest pain with that?"
    },
    {
      "speaker": "PATIENT",
      "text": "No, um, well yeah it's painful to <UNIN/>, when the heart, when my heart is beating fast but, but, yeah."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "And, in the daytime, how, how, you said you, you're not getting much sleep so, how's your energy level in the daytime?"
    },
    {
      "speaker": "PATIENT",
      "text": "It's just, really, really low, <UNSURE>I mean I</UNSURE>, I'm finding now that I'm just, I find no enjoyment at all."
    },
    {
      "speaker": "PATIENT",
      "text": "<UNSURE>It's</UNSURE> kind of day-to-day, <UNSURE>and</UNSURE> anything that <UNSURE>I'm</UNSURE> doing. It's not just my job it's, you know when I leave I'm just so tired that, anything that, previously was, really fun is just not, <UNSURE>it's</UNSURE> not enjoyable. And I'm <UNIN/> like, yeah, on edge the whole time."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. So what do you do in the evenings?"
    },
    {
      "speaker": "PATIENT",
      "text": "Well right now <UNSURE>I'm</UNSURE>, I'm working so late, <UNSURE>and</UNSURE> everything is really, really stressful. So I don't really get much time to myself but, when I do wanna go out, or, you know, see friends or just relax. It, it seems quite difficult to do that."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK, and <UNIN/>, are you avoiding contact with friends, or do you still see them?"
    },
    {
      "speaker": "PATIENT",
      "text": "I avoid them insomuch that I, feel like I'm."
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah, so I mean sometimes it just, I know that I'm not gonna have fun, because I don't want to, go out and, do things that I would normally have done."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. What about, hobbies, or exercise, or anything else outside work? Do you do anything else outside work?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah, as I say like everything that I had previously been doing has been, just difficult to continue with like, I did used to like to like go running, and."
    },
    {
      "speaker": "PATIENT",
      "text": "And to play tennis and stuff, but now it's just not, I'm just not enjoying it, I'm not, I'm not like, I'm not going out to do that quite so much."
    },
    {
      "speaker": "DOCTOR",
      "text": "And have <UNSURE>you</UNSURE>, has it ever got so bad that you've actually had to miss work?"
    },
    {
      "speaker": "PATIENT",
      "text": "No, 'cause I think that would just add to the tension, but I do like pretty much every morning I think, ohh I should call in sick or like, <UNSURE>just</UNSURE> not go."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "And, what's the worst that it's got? Have you ever, been, um, so overwhelmed that you couldn't, get in to the office, you couldn't, go into a situation?"
    },
    {
      "speaker": "DOCTOR",
      "text": "Have you ever <UNSURE>had a</UNSURE> panic attack?"
    },
    {
      "speaker": "PATIENT",
      "text": "<UNIN/>, um."
    },
    {
      "speaker": "PATIENT",
      "text": "No I wouldn't say so, I think, I've always managed to make it to work."
    },
    {
      "speaker": "PATIENT",
      "text": "But I, I wonder if it's building up. So this is why I wanted to call, <UNIN/> I'm <UNSURE>just</UNSURE> worried it's building up to that, and I don't know what to do 'cause I <UNSURE>have</UNSURE>, feel it, felt it, get worse and worse over the past couple of <UNSURE>months</UNSURE>."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. And apart from work, are there any other situations <UNSURE>which evoke</UNSURE> quite extreme anxiety, like being, in public places, social situations, public transport, anything like that?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah I mean, I find public transport really stressful anyway, especially being on the tube it's, 'cause it's quite, getting warmer so it's just really airless."
    },
    {
      "speaker": "PATIENT",
      "text": "Um, but I think the majority of it, 'cause my life is just so focused around work right now, the majority of it is focused around work as well."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Before this did you have any similar times in your life when you felt like this?"
    },
    {
      "speaker": "PATIENT",
      "text": "Not really I, I'm, no, I would say. I mean everybody always has a bit of tension, a bit of anxiety but, I've never felt, anything this bad before."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. And what about your mood day-to-day? I mean, I can see that you're quite distressed by <UNSURE>like</UNSURE> that. Do you ever get really down about this?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah."
    },
    {
      "speaker": "PATIENT",
      "text": "Um, I mean, yeah, yeah, 'cause I do, yeah. I'm pretty much, down like, I don't enjoy, being <UNSURE>and not just</UNSURE> my day at all 'cause."
    },
    {
      "speaker": "PATIENT",
      "text": "I'm just so worried about everything, um, and I find that even when I'm not, like even at the weekends and stuff it's just the, kind of like constant, feeling of just being a bit, down, a bit unhappy."
    },
    {
      "speaker": "DOCTOR",
      "text": "When do you think you last felt yourself?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um."
    },
    {
      "speaker": "PATIENT",
      "text": "I don't know, that's a good question, I can't really, I can't really put a <UNIN/> on that at all."
    },
    {
      "speaker": "DOCTOR",
      "text": "<INAUDIBLE_SPEECH/>. And <UNSURE>has</UNSURE> your mood ever been so low that you've felt like you just couldn't carry on with your job, or with your life, or with your normal, uh, things as they we're going on?"
    },
    {
      "speaker": "PATIENT",
      "text": "I wouldn't, no I wouldn't say that I've had, I haven't had any suicidal thoughts or any, thoughts that have been that extreme like, I haven't."
    },
    {
      "speaker": "PATIENT",
      "text": "You know I have, I have a good support system, like I do have good family and stuff. So I, I have, I don't have, uh worries about, actually wanting to, um, not go on. It's just that, I don't wanna go on like this."
    },
    {
      "speaker": "DOCTOR",
      "text": "Yeah. OK. And where do <UNSURE>you</UNSURE>, who do you live with at home?"
    },
    {
      "speaker": "PATIENT",
      "text": "Sorry?"
    },
    {
      "speaker": "DOCTOR",
      "text": "Who do you live with at home?"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah, I live with my parents, just my <UNSURE>parents</UNSURE>."
    },
    {
      "speaker": "DOCTOR",
      "text": "Um, and, how much alcohol do you have in an average week do you think?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, ooh I don't know, probably quite a lot on the Friday or Saturday, just because, that, that's kind of normal, um."
    },
    {
      "speaker": "PATIENT",
      "text": "<UNSURE>Uh</UNSURE>, maybe I, maybe I do have like a bit during the week. Like, my parents obviously are retired, so they just drink whenever they want, so, whenever they're having a glass of wine, they'll offer it to me and it's like. I guess I don't really keep track of it that much."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. So, how much would you, would you guess?"
    },
    {
      "speaker": "PATIENT",
      "text": "Probably like, probably quite a lot on a Friday or Saturday, because it's usually going out, so maybe like."
    },
    {
      "speaker": "PATIENT",
      "text": "I probably go over my limit just on those <UNSURE>days</UNSURE>, anyway, and then like, maybe a glass of wine during the week <INAUDIBLE_SPEECH/>."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. Do you smoke or take any other drugs, or anything?"
    },
    {
      "speaker": "PATIENT",
      "text": "Um, I try not to smoke, but I do, occasionally, but I don't take drugs."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. And have you done <UNIN/>, anything yourself to help? Have you <UNIN/>, have you talked to anyone, talked to any counsellors? Done any, online, looked online at all? Any ways to <UNIN/>?"
    },
    {
      "speaker": "PATIENT",
      "text": "I, well I talk to my mum, because she also suffers from, well she's <UNIN/>, suffered from like depression in the past. I didn't think that it was, that I was suffering from, actual depression because it just seems to be, manifesting as, as total <UNIN/>, as just stress the whole time."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "PATIENT",
      "text": "But um, I did talk to my mum about it but I haven't sought any, she recommended that I come to the GP, um, but I haven't sought any other."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "And would you be happy to, have, some one-to-one therapy?"
    },
    {
      "speaker": "PATIENT",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah I think, yeah I think so. I've never done that before, but yeah."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK. I mean what we would suggest in the first instance is to, to. So you can self-refer via the NHS, for what we call like, talking therapy which is a type of inter-behavioural, where they can really look at your situation. How you're reacting to, the, <UNIN/>, <UNSURE>why</UNSURE>, what's provoking anxiety, and what you can do, to try and overcome that."
    },
    {
      "speaker": "PATIENT",
      "text": "OK."
    },
    {
      "speaker": "PATIENT",
      "text": "Yeah."
    },
    {
      "speaker": "DOCTOR",
      "text": "Um, so I can send you the link for that."
    },
    {
      "speaker": "DOCTOR",
      "text": "Um, in the meantimes it can be a bit of a wait. There are some online resources that are really helpful. Um, <UNSURE>can</UNSURE> put the details, on there and you can, get on with them straight away and try and work through them as well."
    },
    {
      "speaker": "PATIENT",
      "text": "Uh-huh."
    },
    {
      "speaker": "DOCTOR",
      "text": "Um, and if you're feeling like it's not helping at all, or your anxiety is getting worse, to the point where you can't cope with work, or you can't, just do your normal things day-to-day. Then, it's important for us to, for you to give us a call, back and just discuss that, further."
    },
    {
      "speaker": "PATIENT",
      "text": "OK. <INAUDIBLE_SPEECH/>."
    },
    {
      "speaker": "DOCTOR",
      "text": "I mean some people, with anxiety they, do need to take medication to control that but that's, not something that <UNSURE>we'd</UNSURE> suggest in the first instance."
    },
    {
      "speaker": "PATIENT",
      "text": "OK."
    },
    {
      "speaker": "DOCTOR",
      "text": "And I'll put some more information on your notes about, helping with your, sleep patterns and things like that."
    },
    {
      "speaker": "PATIENT",
      "text": "That's great, I look forward to reading it."
    },
    {
      "speaker": "DOCTOR",
      "text": "Um, in terms of palpitations, it is most likely to be a, <UNIN/>, associated with anxiety, but it's probably worth having couple of basic blood tests just to make sure that, there's not something triggering that off. And then arranging a GP follow-up a week after you've had the tests, so we can just go through the results with you."
    },
    {
      "speaker": "PATIENT",
      "text": "<INAUDIBLE_SPEECH/>"
    },
    {
      "speaker": "PATIENT",
      "text": "OK, OK. Yeah, <UNIN/>."
    },
    {
      "speaker": "DOCTOR",
      "text": "So if you call the support line you can arrange the, to have the blood test done."
    },
    {
      "speaker": "PATIENT",
      "text": "OK, I'll call them up."
    },
    {
      "speaker": "DOCTOR",
      "text": "OK?"
    },
    {
      "speaker": "PATIENT",
      "text": "Thank you so much."
    },
    {
      "speaker": "DOCTOR",
      "text": "All right. Take care."
    },
    {
      "speaker": "PATIENT",
      "text": "Have a good day. Bye."
    },
    {
      "speaker": "DOCTOR",
      "text": "Sorry. <INAUDIBLE_SPEECH/>."
    }
  ],
  "events": null,
  "notes": null
}